#ifndef _ZM124U_H_
#define _ZM124U_H_

//函数接口返回值，<0为错误码
enum
{
 IFD_OK = 0,            // 执行成功
 IFD_ICC_TypeError= -1, // 卡片类型不对
 IFD_ICC_NoExist=  -2,  // 无卡
 IFD_ICC_NoPower=  -3,  // 有卡未上电
 IFD_ICC_NoResponse= -4,// 卡片无应答
 IFD_ICC_BCCError=  -5, // BCC校验错误
 IFD_ICC_TimeOut=   -6, // 接收超时
 IFD_ICC_RunFail=   -7, // 执行失败
 IFD_ICC_SiteFail=  -8, // 卡片位置错误
 IFD_ICC_SetFail=   -9, // 设置失败
 IFD_NoSlot=        -10,// 无卡
 IFD_ConnectError= -11, // 读卡器连接错
 IFD_UnConnected= -12,  // 未建立连接(没有执行打开设备函数)
 IFD_BadCommand= -13,   // (动态库)不支持该命令
 IFD_ParameterError= -14,//(发给动态库的)命令参数错
 IFD_CheckSumError= -15, // 信息校验和出错
 IFD_ICC_PowerFail= -16, // 卡片上电失败
 IFD_ICC_ResetFail= -17, // 卡片复位失败
 IFD_ICC_PowerOffFail= -18,//卡片下电失败
};



/*********************************************************************************
函数功能：接触式CPU卡冷复位
参数说明：resp：  冷复位返回的信息
          resp_len：信息长度
**********************************************************************************/
extern "C" _declspec(dllexport) int ICC_C_Reset(unsigned char *resp,int *resp_len);



/*********************************************************************************
函数功能：接触式CPU卡热复位
参数说明：resp：热复位返回的信息
          resp_len：信息的长度
**********************************************************************************/
extern "C"_declspec(dllexport)  int ICC_H_Reset(unsigned char *resp,int *resp_len);



/*********************************************************************************
函数功能：接触式CPU卡下电
参数说明：无
         
**********************************************************************************/
extern "C"_declspec(dllexport)  int ICC_Power_Off(void);




/*********************************************************************************
函数功能：接触式卡APDU命令函数
参数说明：Lenth_of_Command_APDU:发送的APDU命令长度
          Rsep_len: 返回的信息的长度
          Command_APDU:发送的APDU命令
          Resp_APDU:返回的ATR信息
**********************************************************************************/
extern "C"_declspec(dllexport)  int ICC_Application(int Lenth_of_Command_APDU, 
												   int *Rsep_len,
												   unsigned char* Command_APDU, 
												   unsigned char* Resp_APDU
                                                   );





/*********************************************************************************
函数功能：检测接触式卡SAM卡状态
参数说明：无        
**********************************************************************************/
extern "C" _declspec(dllexport) int PASM_Check(void);




/*********************************************************************************
函数功能：非接触式卡上电
参数说明：无        
**********************************************************************************/
extern "C" _declspec(dllexport) int IDD_PowerOn(void);



/*********************************************************************************
函数功能：非接触式卡下电
参数说明：无        
**********************************************************************************/
extern "C" _declspec(dllexport) int IDD_PowerOff(void);





/*********************************************************************************
函数功能：非接触式卡复位
参数说明：resp：复位返回的信息
          resp_len：返回信息的长度         
**********************************************************************************/
extern "C"_declspec(dllexport)  int IDD_Reset(unsigned char *resp,int *resp_len);





/*********************************************************************************
函数功能：获取非接触式卡UID
参数说明：uid：复位返回的信息
          uid_len：返回信息的长度         
**********************************************************************************/
extern "C" _declspec(dllexport) int IDD_UID(unsigned char *uid,int* uid_len);





/*********************************************************************************
函数功能：非接触式卡APDU命令函数
参数说明：COS：发送的APDU命令
          COS_len：APDU命令的长度
          resp：返回的ATR信息
          resp_len：返回的ATR信息的长度
**********************************************************************************/
extern "C" _declspec(dllexport) int IDD_COS(unsigned char *COS,int COS_len,unsigned char *resp,int *resp_len);





/*********************************************************************************
函数功能：读取读卡器版本信息
参数说明：resp：返回的ATR信息
          resp_len：返回的ATR信息的长度        
**********************************************************************************/
extern "C"_declspec(dllexport)  int Reader_Version(unsigned char *resp,int *resp_len);




/*********************************************************************************
函数功能：停止自动寻卡
参数说明：无       
**********************************************************************************/
extern "C"_declspec(dllexport)  int Stop_Auto_Find();




/*********************************************************************************
函数功能：开启自动寻卡
参数说明：无         
**********************************************************************************/
extern "C" _declspec(dllexport) int Auto_Find();




/*********************************************************************************
函数功能：设置LED灯
参数说明：data：LED灯显示的信息
          data_len：信息的长度
          point：小数点位数(0~6)
**********************************************************************************/
extern "C" _declspec(dllexport) int LED(char *data,int data_len,unsigned char point);




/*********************************************************************************
函数功能：设置时钟
参数说明：times：时钟信息
          times_len：信息的长度
**********************************************************************************/
extern "C" _declspec(dllexport) int Adjust_Clock(unsigned char *times,int times_len);



/*********************************************************************************
函数功能：获取读卡器时间
参数说明：resp：读取的时间信息
          resp_len：信息的长度
**********************************************************************************/
extern "C" _declspec(dllexport) int Get_time(unsigned char *resp,int *resp_len);




/*********************************************************************************
函数功能：设置读卡器正确操作时的闹铃响应
参数说明：buzzer_duration：鸣叫时间,单位(ms)
          silent_duration：停止时间,单位(ms)
          repeat_time：重复响应次数
          flag：设置成功的响应标志 (0为设置完成时不鸣叫，1为设置完成时鸣叫) 
**********************************************************************************/
extern "C" _declspec(dllexport) int buzzer_setting(unsigned char buzzer_duration,
												   unsigned char silent_duration,
												   int repeat_time,
												   int flag=0);




/*********************************************************************************
函数功能：设置读卡器错误操作时的闹铃响应
参数说明：buzzer_duration：鸣叫时间，单位(ms)
          silent_duration：停止时间,单位(ms)
          repeat_time：重复响应次数
          flag：设置成功的响应标志 (0为设置完成时不鸣叫，1为设置完成时鸣叫)        
**********************************************************************************/
extern "C" _declspec(dllexport) int buzzer_failsetting(unsigned char buzzer_duration,
													   unsigned char silent_duration,
													   int repeat_time,
													   int flag=0);




/*********************************************************************************
函数功能：获取M1卡UID
参数说明：uid：获取的UID信息
          uid_len：信息的长度
**********************************************************************************/
extern "C" _declspec(dllexport)int find_14443(unsigned char* uid,int* uid_len);




/*********************************************************************************
函数功能：读取M1卡块信息
参数说明：page：M1卡扇区号
          block：M1卡块号
		  pswtype：密钥类型
          psw：密钥值
          des_data：读取的信息
          des_len： 信息的长度
**********************************************************************************/
extern "C" _declspec(dllexport)int read_block(int page,
											  int block,
											  unsigned char pswtype,
											  unsigned char *psw,
											  unsigned char *des_data,
											  int* des_len);






/*********************************************************************************
函数功能：向M1卡写信息
参数说明：block：M1卡块号
          page： M1卡扇区号
		  pswtype：密钥类型
          psw：密钥值
          src_data：写入的信息数据
          src_len： 信息的长度
**********************************************************************************/
extern "C" _declspec(dllexport)int write_block(int block,
											   int page,
											   unsigned char pswtype,
											   unsigned char *psw,
											   unsigned char *src_data,
											   int src_len);




/*********************************************************************************
函数功能：对M1卡指定扇区下某块进行初始化
参数说明：page：M1卡扇区号
          block：M1卡块号
          pswtype：密钥类型
          psw：密钥值
          account：初始化的数据
**********************************************************************************/
extern "C" _declspec(dllexport)int write_account(int page,
												 int block,
												 unsigned char pswtype,
												 unsigned char *psw,
												 LONG account);





/*********************************************************************************
函数功能：获取M1卡指定扇区下某块的数据
参数说明：page：M1卡扇区号
          block：M1卡块号
		  pswtype：密钥类型
          psw：密钥值
          account：获取的数据
**********************************************************************************/
extern "C" _declspec(dllexport)int read_account(int page,
												int block,
												unsigned char pswtype,
												unsigned char *psw,
												LONG* account);






/*********************************************************************************
函数功能：对M1卡钱包进行充值操作
参数说明：page：M1卡的扇区号
          block：M1卡的块号
		  pswtype：密钥类型
          psw：密钥值
          addAccount：充值金额
**********************************************************************************/
extern "C" _declspec(dllexport)int add_account(int page,
											   int block,
											   unsigned char pswtype,
											   unsigned char *psw,
											   long addAccount);






/*********************************************************************************
函数功能：对M1卡钱包进行消费操作
参数说明：page：M1卡扇区号
          block：M1卡块号
		  pswtype：密钥类型
          psw：密钥值
          subAccount：消费金额
**********************************************************************************/
extern "C" _declspec(dllexport)int sub_account(int page,
											   int block,
											   unsigned char pswtype,
											   unsigned char *psw,
											   long subAccount);







/**********************************************************************************
函数功能：给读卡器开场
参数说明：无
***********************************************************************************/
extern "C" _declspec(dllexport) int RFID15693_PowerOn( );




/**********************************************************************************
函数功能：获取15693卡片UID号
参数说明：resp:指向存储返回信息数据区域的指针

***********************************************************************************/
extern "C" _declspec(dllexport) int RFID15693_FindUid(unsigned char *resp);





/***********************************************************************************
函数功能：读取15693卡片的数据
函数参数：blocknum :终止块号
          resp:指向存储返回信息数据区域的指针
          fl：指向存储返回特定信息数据区域的指针大小64BYTE
***********************************************************************************/
extern "C" _declspec (dllexport) int RFID15693_ReadFile(int blocknum,
													   unsigned char *resp,
													   unsigned char *fl);





/***********************************************************************************
函数功能：向15693卡片写数据
函数参数：src_data：指向存储写入卡片数据区域的指针
          src_len ：写入卡片数据的长度

************************************************************************************/
extern "C" _declspec(dllexport) int RFID15693_WriteFile(unsigned char *src_data,
														int src_len);





/***********************************************************************************
函数功能：读取15693卡片某块的数据
函数参数：block ：指定的块号
		  resp  ：指向存储返回信息数据区域的指针
        
************************************************************************************/
extern "C" _declspec(dllexport) int RFID15693_ReadSingle(int block,
														 unsigned char *resp);






/************************************************************************************
函数功能：向15693卡片指定块写数据
函数参数：block ：指定的块号
          src_data：指向存储写入卡片数据区域的指针
		  src_len：写入数据的长度
*************************************************************************************/
extern "C" _declspec(dllexport) int RFID15693_WriteSingle(int block,
														  unsigned char *src_data,
														  int src_len);





/*************************************************************************************
函数功能：锁定15693卡片指定块的数据
函数参数：block:指定块号
*************************************************************************************/
extern "C" _declspec(dllexport) int RFID15693_LockBlock(int block);





/*************************************************************************************
函数功能：向15693卡片写AFI
函数参数：afi:afi数据
*************************************************************************************/
extern "C" _declspec(dllexport) int RFID15693_WriteAFI(unsigned char afi);





/************************************************************************************
函数功能：锁定15693卡片的afi
函数参数：无
*************************************************************************************/
extern "C" _declspec(dllexport) int RFID15693_LockAFI();






/************************************************************************************
函数功能：向15693卡片写dsfid
函数参数：dsfid;dsfid数据
*************************************************************************************/
extern "C" _declspec(dllexport) int RFID15693_WriteDSFID(unsigned char dsfid);






/*************************************************************************************
函数功能：锁定15693卡片dsfid
函数参数：无
**************************************************************************************/
extern "C" _declspec(dllexport) int RFID15693_LockDSFID();





/**************************************************************************************
函数功能：获取15693卡片系统信息
函数参数：uid_buff:指向存储卡片UID数据区域的指针
          dsfid:指向存储卡片dsfid数据区域的指针
          afi:指向存储卡片afi数据区域的指针
***************************************************************************************/
extern "C" _declspec(dllexport) int RFID15693_GetSystemInfo(unsigned char *uid_buff,
															unsigned char *dsfid,
															unsigned char *afi);




#endif